app/Http/Controllers/Api/UserController.php

    public function getUsers(Request $request){
        $response['success'] = false;
        $data = [];
        if($request->method() !== "GET"){
            $response['message'] = 'Method not allowed!';
            return response()->json($response, $this->forbiddenStatus);
        }
        try{
            $users = User::all();
---
select * from `users`

    public function getSingleUser($id){
        $response['success'] = false;
        $data = [];
        if(! $id){
            $response['message'] = 'User ID is required';
            return response()->json($response, $this->forbiddenStatus);
        }
        try{
            $user = User::find($id);
---
select * from `users` where `users`.`id` = '1' limit 1

    public function createUser(Request $request){
        $response['success'] = false;
        if($request->method() !== "POST"){
            $response['message'] = 'Method not allowed!';
            return response()->json($response, $this->forbiddenStatus);
        }
        try{
            $validator = Validator::make($request->all(),[
                'name' => 'required',
                'mobile' => 'required|string',
                'email' => 'required|email|unique:users,email,',
                'password' => 'required',
            ]);
            if ($validator->fails()) {
                $response['response'] = $validator->messages();
                return response()->json($response, $this->unProcessableEntryStatus);
            }

            // $data = $request->except('_token');
            // $user = User::create($data);
            $user = User::create([
                'name' => $request->name,
                'email' => $request->email,
                'mobile' => $request->mobile,
                'password' => bcrypt($request->password)
            ]);
---
insert into `users` (`name`, `email`, `mobile`, `password`, `updated_at`, `created_at`) values ('asd', 'asd@gmail.com', '0344353', '$2y$10$BFV9cvAOh/KTEu9u/CjEjO1QX/HF0VmSKKNrAZiAQNiBd1BKtPOq.', '2024-02-15 08:50:09', '2024-02-15 08:50:09')